import re  #імпортуємо модуль для регулярних виразів, що знадобиться для опрацювання тексту.
from decimal import Decimal #імпортуємо ф-цію для точних обчислень десяткових чисел.

def generator_numbers(text:list): #створюємо ф-цію для обробки тексту і створення генератору для подальшої роботи.
    res=re.findall(r'\d[\d.]*',text) #створюємо лист де будуть необхідні нам значення:число чи числа з урахуванням коми
    for Gen in res:yield Decimal(Gen.strip()) 
    #створюємо генератор з листа. Додатково прибираю пробіли і перетворюю число з рядка в Decimal для подальших обчислень. 
                                              
        
    
#створюємо ф-цію, що вирахує і поверне суму всіх чисел, що приймає щойностворений генератор
def sum_profit(text, generator_numbers):return sum(generator_numbers(text))
  
#Тут, запропонований завданням, текст для обробки.
text = '''Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід,
        доповнений додатковими надходженнями 27.45 і 324.00 доларів.'''

#запропонована завданням умова для змінної total_income
total_income = sum_profit(text, generator_numbers) #змінна прийме повернене значення з ф-ції sum_profit
print(f"Загальний дохід: {total_income}") #виведення отриманого результату в термінал.
#Вивід був 1351.46. Виведення коректне. 